sobczyk/bsp/csps/lpc32xx/source/lpc32xx_sdcard_driver.c
/***********************************************************************
 * $Id:: lpc32xx_sdcard_driver.c 4978 2010-09-20 22:32:52Z usb10132    $
 *
 * Project: LPC32XX SD card controller driver
 *
 * Description:
 *     This file contains driver support for the LPC32xx SD card
 *     controller.
 *
 ***********************************************************************
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * products. This software is supplied "AS IS" without any warranties.
 * NXP Semiconductors assumes no responsibility or liability for the
 * use of the software, conveys no license or title under any patent,
 * copyright, or mask work right to the product. NXP Semiconductors
 * reserves the right to make changes in the software without
 * notification. NXP Semiconductors also make no representation or
 * warranty that such application will be suitable for the specified
 * use without further testing or modification.
 *********************************************************************/

#include "lpc32xx_clkpwr_driver.h"
#include "lpc32xx_intc_driver.h"
#include "lpc32xx_sdcard_driver.h"

/***********************************************************************
 * SDcard controller driver package data
***********************************************************************/

/* Structure used for DMA control of data */
typedef struct
{
  BOOL_32 dma_enabled;    /* Used to monitor DMA flag state */
  BOOL_32 use_dma;        /* Data transfer DMA support flag */
  DMAC_REGS_T *pdmaregs;  /* Pointer to DMA registers */
  INT_32 dmach;           /* DMA channel */
} SDCARD_DMAC_T;

/* Structure used for data transfer control */
typedef struct
{
  UNS_32  blocksize;      /* Block transfer size in bytes */
  UNS_32  data_to;        /* Data transfer timeout in clocks */
  SD_XFER_T xferdat;      /* Data transfer control structure */
  INT_32  tosend;         /* Number of words to send */
  SD_CMDRESP_T resp;      /* Last command saved response */
} SDCARD_DXFER_T;

/* SDcard controller device configuration structure type */
typedef struct
{
  BOOL_32 init;           /* Device initialized flag */
  SDCARD_REGS_T *regptr;  /* Pointer to SDcard controller registers */
  PFV     sd0_cb;         /* Command callback func pointer */
  PFV     sd1_cb;         /* Data callback func pointer */
  SDCARD_DXFER_T dctrl;   /* Data control structure */
  SDCARD_DMAC_T dmact;    /* DMA control structure */
} SDCARD_CFG_T;

/* SDcard controller driver data */
static SDCARD_CFG_T sdcarddat;

/***********************************************************************
 * SDcard controller driver private functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: sd_dma_enable
 *
 * Purpose: Allocate and enable the SD card controller DMA channel
 *
 * Processing:
 *     Attempt to get a DMA channel from the DMA allocation driver.
 *     If the channel was allocated ok, then clear any DMA interrupts
 *     and setup the channel into default clear state.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: _NO_ERROR if DMA was setup correctly, otherwise _ERROR
 *
 * Notes: None
 *
 **********************************************************************/
static STATUS sd_dma_enable(void)
{
  STATUS err = _NO_ERROR;

  /* Get a channel and setup the callback for the DMA transfer */
  sdcarddat.dmact.dmach = dma_alloc_channel(-1, NULL);
  if (sdcarddat.dmact.dmach == _ERROR)
  {
    sdcarddat.dmact.use_dma = FALSE;
    err = _ERROR;
  }
  else
  {
    /* Get pointer to DMA registers */
    sdcarddat.dmact.pdmaregs = dma_get_base();

    /* Disable and clear DMA channel interrupts */
    sdcarddat.dmact.pdmaregs->int_tc_clear =
      _BIT(sdcarddat.dmact.dmach);
    sdcarddat.dmact.pdmaregs->int_err_clear =
      _BIT(sdcarddat.dmact.dmach);
    sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.dmact.dmach].
    config_ch = 0;

    /* Enable DMA in the SD card controller */
    sdcarddat.regptr->sd_dctrl |= SD_DMA_EN;
  }

  return err;
}

/***********************************************************************
 *
 * Function: sd_dma_disable
 *
 * Purpose: Disable and return the SD card controller DMA channel
 *
 * Processing:
 *     Free (and disable) the DMA channel allocated to this driver.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
static void sd_dma_disable(void)
{
  sdcarddat.regptr->sd_dctrl &= ~SD_DMA_EN;
  dma_free_channel(sdcarddat.dmact.dmach);
}

/***********************************************************************
 *
 * Function: prep_cmd_resp
 *
 * Purpose: Prepare a command response register function
 *
 * Processing:
 *     The command state machine is setup with the expected response
 *     type adn returned to the caller.
 *
 * Parameters:
 *     pcmd : Pointer to a command control structure
 *
 * Outputs: None
 *
 * Returns: Prepared command register word
 *
 * Notes: None
 *
 **********************************************************************/
static UNS_32 prep_cmd_resp(SD_CMD_T *pcmd)
{
  UNS_32 resp;

  /* Generate response mask */
  if (pcmd->cmd_resp_size == 0)
  {
    resp = 0;
  }
  else
  {
    resp = (SD_CMD_RESP_RECEIVED | SD_CMD_TIMEOUT |
            SD_CMD_CRC_FAIL);
  }

  return resp;
}

/***********************************************************************
 *
 * Function: prep_cmd
 *
 * Purpose: Prepare a command register function
 *
 * Processing:
 *     The command state machine is setup with the passed argument,
 *     command, expected response type, and busy wait status. If a
 *     response is expected, then the command state machine and expected
 *     interrupts are setup the receive a response. The command
 *     interrupt is cleared and enabled.
 *
 * Parameters:
 *     pcmd : Pointer to a command control structure
 *
 * Outputs: None
 *
 * Returns: Prepared command register word
 *
 * Notes: None
 *
 **********************************************************************/
static UNS_32 prep_cmd(SD_CMD_T *pcmd)
{
  UNS_32 resp, tmp;

  /* Write arg register first */
  sdcarddat.regptr->sd_arg = pcmd->arg;

  /* Generate command word */
  tmp = pcmd->cmd;
  resp = prep_cmd_resp(pcmd);
  switch (pcmd->cmd_resp_size)
  {
    case 0:
      /* No response expected */
      break;

    case 136:
      tmp |= (SD_RESPONSE | SD_LONGRESP_EN);
      break;

    default:
      tmp |= SD_RESPONSE;
      break;
  }

