sobczyk/bsp/csps/lpc32xx/source/lpc32xx_sdcard_driver.c
  /* Clear latched command statuses and enable command state
     machine interrupts */
  sdcarddat.regptr->sd_clear = (resp | SD_CMD_SENT);
  sdcarddat.regptr->sd_mask0 = (resp | SD_CMD_SENT);
  int_enable(IRQ_SD0);

  return tmp;
}

/***********************************************************************
 *
 * Function: sd1_dmarx_interrupt
 *
 * Purpose: DMA specific SD card data read interrupt handler
 *
 * Processing:
 *     See function.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
static void sd1_dmarx_interrupt(void)
{
  UNS_32 dint;
  BOOL_32 done = FALSE;

  /* A data interrupt was received */
  dint = sdcarddat.regptr->sd_status;

  /* Has data transfer completed? */
  if ((dint & SD_DATA_END) != 0)
  {
    done = TRUE;
  }

  /* Has a data error occurred? */
  if ((dint & (SD_FIFO_TXDATA_UFLOW | SD_DATA_TIMEOUT |
               SD_DATA_CRC_FAIL)) != 0)
  {
    done = TRUE;
  }

  if (done == TRUE)
  {
    int_disable(IRQ_SD1);
    sdcarddat.regptr->sd_dctrl &= ~SD_DATATRANSFER_EN;
    sdcarddat.regptr->sd_mask1 = 0;
    sdcarddat.dctrl.resp.data_status = dint;

    if (sdcarddat.sd1_cb != NULL)
    {
      sdcarddat.sd1_cb();
    }

    /* Disable DMA */
    sdcarddat.dmact.pdmaregs->sync &= ~DMA_PER_SDCARD;
    sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.
                                        dmact.dmach].config_ch &=
										~DMAC_CHAN_ENABLE;
  }

  /* Clear checked statuses */
  sdcarddat.regptr->sd_clear = dint;
}

/***********************************************************************
 *
 * Function: sd1_dmatx_interrupt
 *
 * Purpose: DMA specific SD card data write interrupt handler
 *
 * Processing:
 *     See function.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
static void sd1_dmatx_interrupt(void)
{
  UNS_32 dint;
  BOOL_32 done = FALSE;

  /* A data interrupt was received */
  dint = sdcarddat.regptr->sd_status;

  /* Has data transfer completed? */
  if ((dint & SD_DATA_END) != 0)
  {
    done = TRUE;
  }

  /* Has a data error occurred? */
  if ((dint & (SD_FIFO_TXDATA_UFLOW | SD_DATA_TIMEOUT |
               SD_DATA_CRC_FAIL)) != 0)
  {
    done = TRUE;
  }

  if (done == TRUE)
  {
    int_disable(IRQ_SD1);
    sdcarddat.regptr->sd_dctrl &= ~SD_DATATRANSFER_EN;
    sdcarddat.regptr->sd_mask1 = 0;
    sdcarddat.dctrl.resp.data_status = dint;

    if (sdcarddat.sd1_cb != NULL)
    {
      sdcarddat.sd1_cb();
    }

    /* Disable DMA */
    sdcarddat.dmact.pdmaregs->sync &= ~DMA_PER_SDCARD;
    sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.
                                        dmact.dmach].config_ch &=
										~DMAC_CHAN_ENABLE;
  }

  /* Clear checked statuses */
  sdcarddat.regptr->sd_clear = dint;
}

/***********************************************************************
 *
 * Function: sd1_rx_interrupt
 *
 * Purpose: Default SD card data read interrupt handler
 *
 * Processing:
 *     See function.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
static void sd1_rx_interrupt(void)
{
  UNS_32 dint;
  INT_32 idx;
  BOOL_32 done = FALSE;

  /* A data interrupt was received */
  dint = sdcarddat.regptr->sd_status;
  sdcarddat.dctrl.resp.data_status = dint;

  /* Has data transfer completed? */
  if ((dint & SD_DATABLK_END) != 0)
  {
    /* No more data expected, so read what's left in the FIFO */
    while ((sdcarddat.regptr->sd_status &
            SD_FIFO_RXDATA_AVAIL) != 0)
    {
      *sdcarddat.dctrl.xferdat.buff =
        sdcarddat.regptr->sd_fifo [0];
      sdcarddat.dctrl.xferdat.buff++;
    }

    /* Only stop if this is the last block */
    if (sdcarddat.dctrl.xferdat.blocks == 0)
    {
      done = TRUE;
    }
    else
    {
      sdcarddat.dctrl.xferdat.blocks--;
    }
  }
  else if ((dint & SD_FIFO_RXDATA_HFULL) != 0)
  {
    /* The FIFO is at least half full, so read out 8 words
       of data */
    for (idx = 0; idx < 8; idx++)
    {
      *sdcarddat.dctrl.xferdat.buff =
        sdcarddat.regptr->sd_fifo [0];
      sdcarddat.dctrl.xferdat.buff++;
    }
  }

  /* Has a data error occurred? */
  if ((dint & (SD_STARTBIT_ERR | SD_FIFO_RXDATA_OFLOW |
               SD_DATA_TIMEOUT | SD_DATA_CRC_FAIL)) != 0)
  {
    done = TRUE;
  }

  if (done == TRUE)
  {
    int_disable(IRQ_SD1);
    sdcarddat.regptr->sd_dctrl &= ~SD_DATATRANSFER_EN;
    sdcarddat.regptr->sd_mask1 = 0;

    if (sdcarddat.sd1_cb != NULL)
    {
      sdcarddat.sd1_cb();
    }
  }

  /* Clear checked statuses */
  sdcarddat.regptr->sd_clear = dint;
}

/***********************************************************************
 *
 * Function: sd1_tx_interrupt
 *
 * Purpose: Default SD card data write int handler
 *
 * Processing:
 *     See function.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
static void sd1_tx_interrupt(void)
{
  UNS_32 dint;
  INT_32 cnt, idx;
  BOOL_32 done = FALSE;

  /* A data interrupt was received */
  dint = sdcarddat.regptr->sd_status;

  /* Has data transfer completed? */
  if ((dint & SD_DATABLK_END) != 0)
  {
    /* Only stop if this is the last block */
    if (sdcarddat.dctrl.xferdat.blocks == 0)
    {
      done = TRUE;
    }
    else
    {
      sdcarddat.dctrl.xferdat.blocks--;
    }
  }

  if ((sdcarddat.regptr->sd_status & SD_FIFO_TXDATA_HEMPTY) != 0)
  {
    /* The FIFO needs more data */
    while (((sdcarddat.regptr->sd_status &
             SD_FIFO_TXDATA_HEMPTY) != 0) &&
           (sdcarddat.dctrl.tosend > 0))
    {
      sdcarddat.regptr->sd_fifo [0] =
        *sdcarddat.dctrl.xferdat.buff;
      sdcarddat.dctrl.xferdat.buff++;
      sdcarddat.dctrl.tosend -= 1;
    }

    /* Up to 8 more words can be stuffed into the FIFO */
    cnt = sdcarddat.dctrl.tosend;
    if (cnt > 7)
    {
      cnt = 7;
    }
    for (idx = 0; idx < cnt; idx++)
    {
      sdcarddat.regptr->sd_fifo [0] =
        *sdcarddat.dctrl.xferdat.buff;
      sdcarddat.dctrl.xferdat.buff++;
    }
    sdcarddat.dctrl.tosend -= cnt;

    if (sdcarddat.dctrl.tosend == 0)
    {
      /* Disable FIFO related interrupts */
      sdcarddat.regptr->sd_mask1 &= ~(SD_FIFO_TXDATA_EMPTY |
                                      SD_FIFO_TXDATA_HEMPTY);
    }
  }

