sobczyk/bsp/csps/lpc32xx/source/lpc32xx_sdcard_driver.c
  /* Has a data error occurred? */
  if ((dint & (SD_FIFO_TXDATA_UFLOW | SD_DATA_TIMEOUT |
               SD_DATA_CRC_FAIL)) != 0)
  {
    done = TRUE;
  }

  if (done == TRUE)
  {
    int_disable(IRQ_SD1);
    sdcarddat.regptr->sd_dctrl &= ~SD_DATATRANSFER_EN;
    sdcarddat.regptr->sd_mask1 = 0;
    sdcarddat.dctrl.resp.data_status = dint;

    if (sdcarddat.sd1_cb != NULL)
    {
      sdcarddat.sd1_cb();
    }
  }

  /* Clear checked statuses */
  sdcarddat.regptr->sd_clear = dint;
}

/***********************************************************************
 *
 * Function: sd0_cmd_interrupt
 *
 * Purpose: Default SD card command interrupt handler
 *
 * Processing:
 *     This function is called when an SD0 card interrupt is generated.
 *     This will save the command status and response if it is valid.
 *     The command state machine is cleared and any commands interrupts
 *     are cleared and masked. If the user defined command callback
 *     function exists, then it is called before exiting this function.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: The user callback function is called in interrupt context.
 *
 **********************************************************************/
static void sd0_cmd_interrupt(void)
{
  int idx;
  UNS_32 cmd;

  /* Save status */
  sdcarddat.dctrl.resp.cmd_status = sdcarddat.regptr->sd_status;

  /* Save response */
  sdcarddat.dctrl.resp.cmd_resp [0] = sdcarddat.regptr->sd_respcmd;
  for (idx = 0; idx < 4; idx++)
  {
    sdcarddat.dctrl.resp.cmd_resp [idx + 1] =
      sdcarddat.regptr->sd_resp [idx];
  }

  /* Stop command state machine */
  sdcarddat.regptr->sd_cmd &= ~SD_CPST_EN;

  /* Clear pending command statuses */
  sdcarddat.regptr->sd_clear = (SD_CMD_CRC_FAIL | SD_CMD_TIMEOUT |
    SD_CMD_RESP_RECEIVED | SD_CMD_SENT);
  sdcarddat.regptr->sd_mask0 = 0;

  if (sdcarddat.dctrl.xferdat.dataop == SD_DATAOP_WRITE)
  {
    /* Start data state machine */
    sdcarddat.regptr->sd_dctrl |= SD_DATATRANSFER_EN;

    /* Clear FIFO conditions */
    sdcarddat.regptr->sd_clear = (SD_FIFO_TXDATA_HEMPTY |
      SD_DATABLK_END | SD_FIFO_TXDATA_UFLOW | SD_DATA_TIMEOUT |
                                  SD_DATA_CRC_FAIL);

    if (sdcarddat.dmact.dma_enabled == TRUE)
    {
      /* Set DMA receive handler */
      int_install_irq_handler(IRQ_SD1, (PFV) sd1_dmatx_interrupt);

      /* Setup FIFO control conditions to interrupt when data
         block has been received, start bit errors, data FIFO
         overflow, data timeout, or data CRC error */
      sdcarddat.regptr->sd_mask1 = (SD_DATA_END |
        SD_FIFO_TXDATA_UFLOW | SD_DATA_TIMEOUT |
                                    SD_DATA_CRC_FAIL);
      sdcarddat.regptr->sd_dctrl |= SD_DMA_EN;

      /* Setup DMA transfer */
      if (sdcarddat.dctrl.xferdat.buff != NULL)
      {
        /* Setup source */
        sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.
          dmact.dmach].src_addr = (UNS_32) sdcarddat.dctrl.xferdat.buff;
        sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.
                                            dmact.dmach].lli = 0;
        sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.
          dmact.dmach].dest_addr = (UNS_32) & SDCARD->sd_fifo;
        sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.
          dmact.dmach].control = (DMAC_CHAN_SRC_AUTOINC |
		  DMAC_CHAN_SRC_AHB1 | DMAC_CHAN_DEST_WIDTH_32 |
		  DMAC_CHAN_SRC_WIDTH_32 | DMAC_CHAN_DEST_BURST_8 |
		  DMAC_CHAN_SRC_BURST_8);
      }

      /* Set DMA initial control */
      sdcarddat.dmact.pdmaregs->sync |= DMA_PER_SDCARD;

      /* Setup DMA config and start DMA controller */
      sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.
        dmact.dmach].config_ch = (DMAC_CHAN_IE | DMAC_CHAN_FLOW_P_M2P |
		DMAC_DEST_PERIP(DMA_PERID_SDCARD) | DMAC_CHAN_ENABLE);
    }
    else
    {
      /* If not DMA, use FIFO mode */
      /* Setup FIFO control conditions to interrupt when FIFO is
         empty or half empty, data block has been trasmitted, data
         has ended, data underflow, or data CRC error */
      sdcarddat.regptr->sd_mask1 = (SD_FIFO_TXDATA_HEMPTY |
		  SD_DATABLK_END | SD_FIFO_TXDATA_UFLOW | SD_DATA_TIMEOUT |
                                    SD_DATA_CRC_FAIL);

      /* Enable DMA if needed */
      sdcarddat.regptr->sd_dctrl &= ~SD_DMA_EN;

      /* Fill transmit FIFO */
      while ((sdcarddat.regptr->sd_status &
              SD_FIFO_TXDATA_FULL) == 0)
      {
        sdcarddat.regptr->sd_fifo [0] =
          *sdcarddat.dctrl.xferdat.buff;
        sdcarddat.dctrl.xferdat.buff++;
        sdcarddat.dctrl.tosend -= 1;
      }
    }
  }

  /* If a pending command is being used to stop this transfer,
     then set it up now */
  if (sdcarddat.dctrl.xferdat.usependcmd == TRUE)
  {
    sdcarddat.dctrl.xferdat.usependcmd = FALSE;
    cmd = prep_cmd(&sdcarddat.dctrl.xferdat.pendcmd);
    sdcarddat.regptr->sd_cmd = (cmd | 0 |
                                SD_CMDPEND_WAIT);
  }
  else
  {
    /* Disable SDMMC interrupt for now */
    int_disable(IRQ_SD0);

    /* Call command callback function if it exists */
    if (sdcarddat.sd0_cb != NULL)
    {
      sdcarddat.sd0_cb();
    }
  }
}

/***********************************************************************
 *
 * Function: sd_start_data_write
 *
 * Purpose: Start data write transfer operations to a card
 *
 * Processing:
 *     If the number of blocks to transfer is 0, return an error status
 *     to the caller. Install the standard data transmit interrupt
 *     handler. Set the data block size and data timeout clocks in the
 *     controller. Clear any latched data interrupts. Fill the transmit
 *     FIFO and decrement the amount to send by the filled amount.
 *     Enable data transfer interrupts as needed by the transmit
 *     interrupt handler. Decrement the number of blocks to transfer in
 *     the interrupt handler.
 *
 * Parameters:
 *     cmdreg : Command control register value
 *
 * Outputs: None
 *
 * Returns: _NO_ERROR if the configuration was ok, otherwise _ERROR
 *
 * Notes: None
 *
 **********************************************************************/
static STATUS sd_start_data_write(UNS_32 cmdreg)
{
  UNS_32 datalen;
  STATUS status = _ERROR;

  /* Determine data length from block count */
  datalen = sdcarddat.dctrl.blocksize *
            sdcarddat.dctrl.xferdat.blocks;
  if ((datalen > 0) && (datalen <= 65024))
  {
    /* Number of words to send */
    sdcarddat.dctrl.tosend = datalen >> 2;

    /* Set standard transmit handler */
    int_install_irq_handler(IRQ_SD1, (PFV) sd1_tx_interrupt);

    /* Decrement block count for start of transfer */
    sdcarddat.dctrl.xferdat.blocks--;

