sobczyk/bsp/csps/lpc32xx/source/lpc32xx_sdcard_driver.c
    /* Setup blocksize, data length, data timeout, and direction */
    sdcarddat.regptr->sd_dtimer = sdcarddat.dctrl.data_to;
    sdcarddat.regptr->sd_dlen = datalen;
    sdcarddat.regptr->sd_dctrl &= ~SD_DIR_FROMCARD;

    /* Start command state machine */
    sdcarddat.regptr->sd_cmd = (cmdreg | SD_CPST_EN);

    int_enable(IRQ_SD1);

    status = _NO_ERROR;
  }

  return status;
}

/***********************************************************************
 *
 * Function: sd_start_data_read
 *
 * Purpose: Start data read transfer operations from a card
 *
 * Processing:
 *     If the number of blocks to transfer is 0, return an error status
 *     to the caller. Install the standard data receive interrupt
 *     handler. Empty the data FIFO. Enable data transfer interrupts as
 *     needed by the recieve interrupt handler. Set the data block size
 *     and data timeout clocks in the controller. Decrement the number
 *     of blocks to transfer in the interrupt handler.
 *
 * Parameters:
 *     cmdreg : Command control register value
 *
 * Outputs: None
 *
 * Returns: _NO_ERROR if the configuration was ok, otherwise _ERROR
 *
 * Notes: None
 *
 **********************************************************************/
static STATUS sd_start_data_read(UNS_32 cmdreg)
{
  volatile UNS_32 tmp;
  UNS_32 datalen;
  STATUS status = _ERROR;

  /* Determine data length from block count */
  datalen = sdcarddat.dctrl.blocksize *
            sdcarddat.dctrl.xferdat.blocks;
  if ((datalen > 0) && (datalen <= 65024))
  {
    /* Make sure data FIFO is empty */
    while ((sdcarddat.regptr->sd_status &
            SD_FIFO_RXDATA_AVAIL) != 0)
    {
      tmp = sdcarddat.regptr->sd_fifo [0];
    }

    /* Enable DMA if needed */
    if (sdcarddat.dmact.dma_enabled == TRUE)
    {
      /* Set DMA receive handler */
      int_install_irq_handler(IRQ_SD1, (PFV) sd1_dmarx_interrupt);

      /* Setup FIFO control conditions to interrupt when data
         block has been received, start bit errors, data FIFO
         overflow, data timeout, or data CRC error */
      sdcarddat.regptr->sd_clear = (SD_DATA_END |
		  SD_STARTBIT_ERR | SD_FIFO_RXDATA_OFLOW | SD_DATA_TIMEOUT |
                                    SD_DATA_CRC_FAIL);
      sdcarddat.regptr->sd_mask1 = (SD_DATA_END |
		  SD_STARTBIT_ERR | SD_FIFO_RXDATA_OFLOW | SD_DATA_TIMEOUT |
                                    SD_DATA_CRC_FAIL);
      sdcarddat.regptr->sd_dctrl |= SD_DMA_EN;

      /* Setup DMA transfer */
      if (sdcarddat.dctrl.xferdat.buff != NULL)
      {
        /* Setup destination and clear LLI */
        sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.
			dmact.dmach].dest_addr =
            (UNS_32) sdcarddat.dctrl.xferdat.buff;
        sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.
                                            dmact.dmach].lli = 0;
        sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.
			dmact.dmach].src_addr = (UNS_32) & SDCARD->sd_fifo;

        /* Setup DMA config and start DMA controller */
        sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.
			dmact.dmach].control = (DMAC_CHAN_DEST_AUTOINC |
			DMAC_CHAN_SRC_AHB1 | DMAC_CHAN_DEST_WIDTH_32 |
			DMAC_CHAN_SRC_WIDTH_32 | DMAC_CHAN_DEST_BURST_8 |
			DMAC_CHAN_SRC_BURST_8);
      }

      /* Set DMA initial control */
      sdcarddat.dmact.pdmaregs->sync |= DMA_PER_SDCARD;
      sdcarddat.dmact.pdmaregs->dma_chan [sdcarddat.
		  dmact.dmach].config_ch = (DMAC_CHAN_IE |
		  DMAC_CHAN_FLOW_P_P2M | DMAC_SRC_PERIP(DMA_PERID_SDCARD) |
		  DMAC_CHAN_ENABLE);
    }
    else
    {
      /* Set standard receive handler */
      int_install_irq_handler(IRQ_SD1, (PFV) sd1_rx_interrupt);

      /* Setup FIFO control conditions to interrupt when FIFO
         is half full, data block has been received, start bit
         errors, data FIFO overflow, data timeout, or data CRC
         error */
      sdcarddat.regptr->sd_clear = (SD_FIFO_RXDATA_HFULL |
		  SD_DATABLK_END | SD_STARTBIT_ERR | SD_FIFO_RXDATA_OFLOW |
                                    SD_DATA_TIMEOUT | SD_DATA_CRC_FAIL);
      sdcarddat.regptr->sd_mask1 = (SD_FIFO_RXDATA_HFULL |
		  SD_DATABLK_END | SD_STARTBIT_ERR | SD_FIFO_RXDATA_OFLOW |
                                    SD_DATA_TIMEOUT | SD_DATA_CRC_FAIL);
      sdcarddat.regptr->sd_dctrl &= ~SD_DMA_EN;
    }
    int_enable(IRQ_SD1);

    /* Setup blocksize, data length, data timeout, and direction */
    sdcarddat.regptr->sd_dtimer = sdcarddat.dctrl.data_to;
    sdcarddat.regptr->sd_dlen = datalen;
    sdcarddat.regptr->sd_dctrl |= SD_DIR_FROMCARD;

    /* Decrement block count for start of transfer */
    sdcarddat.dctrl.xferdat.blocks--;

    /* Start command state machine */
    sdcarddat.regptr->sd_cmd = (cmdreg | SD_CPST_EN);

    /* Start data state machine */
    sdcarddat.regptr->sd_dctrl |= SD_DATATRANSFER_EN;

    status = _NO_ERROR;
  }

  return status;
}

/***********************************************************************
 *
 * Function: sd_start_data_xfer
 *
 * Purpose: Start data transfer operations to/from a card
 *
 * Processing:
 *     Save the data control structure. If the data operation type is
 *     read, then call the sd_start_data_read function, else call the
 *     sd_start_data_write function.
 *
 * Parameters:
 *     cmdreg : Command control register value
 *
 * Outputs: None
 *
 * Returns: _NO_ERROR if the configuration was ok, otherwise _ERROR
 *
 * Notes: None
 *
 **********************************************************************/
static STATUS sd_start_data_xfer(UNS_32 cmdreg)
{
  STATUS status = _NO_ERROR;

  /* Streaming enabled? */
  if (sdcarddat.dctrl.xferdat.stream == TRUE)
  {
    sdcarddat.regptr->sd_dctrl |= SD_STREAM_EN;
  }
  else
  {
    sdcarddat.regptr->sd_dctrl &= ~SD_STREAM_EN;
  }

  /* Determine direction for transfer */
  if (sdcarddat.dctrl.xferdat.dataop == SD_DATAOP_READ)
  {
    /* Start data read */
    status = sd_start_data_read(cmdreg);
  }
  else
  {
    /* Start data write */
    status = sd_start_data_write(cmdreg);
  }

