sobczyk/bsp/csps/lpc32xx/source/lpc32xx_sdcard_driver.c
  return status;
}

/***********************************************************************
 *
 * Function: sd_issue_cmd
 *
 * Purpose: Start command or data transfer operations to/from a card
 *
 * Processing:
 *     The command state machine is setup with the passed argument,
 *     command, expected response type, and busy wait status. If a
 *     response is expected, then the command state machine and expected
 *     interrupts are setup the receive a response. The command
 *     interrupt is cleared and enabled. If a data transfer is expected
 *     with this command, the command state machine is started in
 *     pending mode and the sd_start_data_xfer() function is called to
 *     start the data operation. If no data is expected, then the
 *     the command state machine is started immediately.
 *
 * Parameters:
 *     pcmd : Pointer to a command and data control structure
 *
 * Outputs: None
 *
 * Returns: _NO_ERROR if the configuration was ok, otherwise _ERROR
 *
 * Notes: None
 *
 **********************************************************************/
static STATUS sd_issue_cmd(SD_CMDDATA_T *pcmd)
{
  UNS_32 tmp;
  STATUS status = _NO_ERROR;

  tmp = prep_cmd(&pcmd->cmd);

  /* Save transfer information */
  sdcarddat.dctrl.xferdat = pcmd->data;

  /* If this function also has data associated with it, then have the
     command state machine kicked off with the data state machine */
  if (pcmd->data.dataop != SD_DATAOP_NONE)
  {
    /* Setup data transfer and start data state machine */
    status = sd_start_data_xfer(tmp);
  }
  else
  {
    /* Start command state machine */
    sdcarddat.dctrl.xferdat.usependcmd = FALSE;
    sdcarddat.regptr->sd_cmd = (tmp | SD_CPST_EN);
  }

  return status;
}

/***********************************************************************
 *
 * Function: sd_set_ctrl_params
 *
 * Purpose: Setup SD controller parameters
 *
 * Processing:
 *     This function sets up the controller options for the SD card
 *     controller interface. Options include pullup configuration,
 *     open drain or push-pull modes, card clock rate, power saving
 *     mode selection, and 1-bit or 4-bit bus operation.
 *
 * Parameters:
 *     pparms : Pointer to parameter config structure
 *
 * Outputs: None
 *
 * Returns: _NO_ERROR if the configuration was ok, otherwise _ERROR
 *
 * Notes: None
 *
 **********************************************************************/
static STATUS sd_set_ctrl_params(SDC_PRMS_T *pparms)
{
  UNS_32 sd_div, sd_clk, tmp;

  /* Setup pullups */
  clkpwr_setup_mcard_ctrlr(1, pparms->pullup23, pparms->pullup1,
                           pparms->pullup0, 1);

  /* Setup power control and bus mode */
  tmp = 0;
  if (pparms->opendrain == TRUE)
  {
    tmp = SD_OPENDRAIN_EN;
  }
  sdcarddat.regptr->sd_power = (tmp | pparms->powermode);

  /* Get current SD clock rate */
  sd_clk = clkpwr_get_clock_rate(CLKPWR_MSCARD_CLK);

  /* Find best divider to generate target clock rate */
  sd_div = 0;
  tmp = 0;
  while ((sd_clk / (2 * (sd_div + 1))) >= pparms->sdclk_rate)
  {
    sd_div++;
  }
  if (sd_div > SD_CLKDIV_MASK)
  {
    /* Limit to maximum supported divider */
    sd_div = SD_CLKDIV_MASK;
  }
  else if (sd_div == 0)
  {
    /* May have to use the clock bypass instead */
    if (pparms->sdclk_rate >= sd_clk)
    {
      tmp |= SD_SDCLK_BYPASS;
    }
  }

  /*  Set SD clocking and bus width */
  if (pparms->use_wide == TRUE)
  {
    tmp |= SD_WIDEBUSMODE_EN;
  }
  if (pparms->pwrsave == TRUE)
  {
    tmp |= SD_SDCLK_PWRSAVE;
  }
  sdcarddat.regptr->sd_clock = (tmp | SD_SDCLK_EN | sd_div);

  return _NO_ERROR;
}

/***********************************************************************
 *
 * Function: sd_set_data_params
 *
 * Purpose: Setup SD data transfer parameters
 *
 * Processing:
 *     This function sets up the data transfer options for SD card
 *     controller block transfers. Options setup include the block
 *     transfer size and data transfer timeout in clocks. If DMA is
 *     used, this also sets up the DMA controller for SD card DMA
 *     used. The command and data callbacks required by the user
 *     application are also setup here.
 *
 * Parameters:
 *     pparms : Pointer to parameter data structure
 *
 * Outputs: None
 *
 * Returns: _NO_ERROR if the configuration was ok, otherwise _ERROR
 *
 * Notes: None
 *
 **********************************************************************/
static STATUS sd_set_data_params(SDC_XFER_SETUP_T *pparms)
{
  STATUS sts = _NO_ERROR;

  /* Save command and data callback function pointers */
  sdcarddat.sd0_cb = pparms->cmd_callback;
  sdcarddat.sd1_cb = pparms->data_callback;

  /* Translate block size to correct register value */
  sdcarddat.dctrl.blocksize = pparms->blocksize;
  switch (pparms->blocksize)
  {
    case 1:
      sdcarddat.regptr->sd_dctrl = SD_BLKSIZE_1BYTE;
      break;

    case 2:
      sdcarddat.regptr->sd_dctrl = SD_BLKSIZE_2BYTES;
      break;

    case 4:
      sdcarddat.regptr->sd_dctrl = SD_BLKSIZE_4BYTES;
      break;

    case 8:
      sdcarddat.regptr->sd_dctrl = SD_BLKSIZE_8BYTES;
      break;

    case 16:
      sdcarddat.regptr->sd_dctrl = SD_BLKSIZE_16BYTES;
      break;

    case 32:
      sdcarddat.regptr->sd_dctrl = SD_BLKSIZE_32BYTES;
      break;

    case 64:
      sdcarddat.regptr->sd_dctrl = SD_BLKSIZE_64BYTES;
      break;

    case 128:
      sdcarddat.regptr->sd_dctrl = SD_BLKSIZE_128BYTES;
      break;

    case 256:
      sdcarddat.regptr->sd_dctrl = SD_BLKSIZE_256BYTES;
      break;

    case 512:
      sdcarddat.regptr->sd_dctrl = SD_BLKSIZE_512BYTES;
      break;

    case 1024:
      sdcarddat.regptr->sd_dctrl = SD_BLKSIZE_1024BYTES;
      break;

    case 2048:
      sdcarddat.regptr->sd_dctrl = SD_BLKSIZE_2048BYTES;
      break;

    default:
      sts = _ERROR;
      break;
  }

