sobczyk/bsp/csps/lpc32xx/source/lpc32xx_sdcard_driver.c
  if (sts != _ERROR)
  {
    /* Set timeout */
    sdcarddat.dctrl.data_to = pparms->data_to;
    sdcarddat.regptr->sd_dtimer = pparms->data_to;

    /* If DMA was perviously disabled and DMA is being enabled, then
       setup DMA now */
    sdcarddat.dmact.use_dma = pparms->use_dma;
    if (sdcarddat.dmact.dma_enabled != sdcarddat.dmact.use_dma)
    {
      if (sdcarddat.dmact.dma_enabled == TRUE)
      {
        /* DMA is being disabled */
        sd_dma_disable();
      }
      else
      {
        /* DMA is being enabled */
        sts = sd_dma_enable();
      }

      sdcarddat.dmact.dma_enabled = sdcarddat.dmact.use_dma;
    }
  }

  return sts;
}

/***********************************************************************
 * SDcard controller driver public functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: sdcard_open
 *
 * Purpose: Open the SD card controller driver
 *
 * Processing:
 *     If the passed driver pointer is valid and the driver hasn't been
 *     previously opened, then enabled the SD card controller clocks
 *     and setup the SD card controller in a safe default configuration.
 *     Setup the default command handler and set the default data for
 *     data and command control structure to initial values.
 *
 * Parameters:
 *     ipbase: Pointer to a SD card controller peripheral block
 *     arg   : Always 0
 *
 * Outputs: None
 *
 * Returns: The pointer to a SD card driver config structure or NULL
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 sdcard_open(void *ipbase,
                   INT_32 arg)
{
  SDC_PRMS_T sdparams_ctrl;
  SDC_XFER_SETUP_T sdparams_dat;
  INT_32 tptr = (INT_32) NULL;

  if ((SDCARD_REGS_T *) ipbase == SDCARD)
  {
    /* Has SD card controller driver been previously initialized? */
    if (sdcarddat.init == FALSE)
    {
      /* Device not initialized and it usable, so set it to
         used */
      sdcarddat.init = TRUE;

      /* Save address of register block */
      sdcarddat.regptr = SDCARD;

      /* Enable SD clock at IP clock divided by 2 */
      clkpwr_clk_en_dis(CLKPWR_MSCARD_CLK, 1);
      sdcarddat.regptr->sd_clock = SD_SDCLK_EN;

      /* Setup SDCARD interface and controller. Enable SD
         controller and pullups, setup clock rate to 390KHz,
         disable wide bus, power off mode */
      sdparams_ctrl.sdclk_rate = 390000;
      sdparams_ctrl.use_wide = FALSE;
      sdparams_ctrl.pwrsave = FALSE;
      sdparams_ctrl.opendrain = TRUE;
      sdparams_ctrl.powermode = SD_POWER_OFF_MODE;
      sdparams_ctrl.pullup0 = 1;
      sdparams_ctrl.pullup1 = 1;
      sdparams_ctrl.pullup23 = 1;
      sd_set_ctrl_params(&sdparams_ctrl);

      /* Disable command and data state machines */
      sdcarddat.regptr->sd_cmd = 0;
      sdcarddat.regptr->sd_dctrl = 0;

      /* Disable all interrupts */
      sdcarddat.regptr->sd_mask0 = 0;
      sdcarddat.regptr->sd_mask1 = 0;

      /* Clear any latched statuses */
      sdcarddat.regptr->sd_clear = 0x7FF;

      /* Install default command interrupt handler */
      int_install_irq_handler(IRQ_SD0, (PFV) sd0_cmd_interrupt);

      /* DMA was not previously enabled */
      sdcarddat.dmact.dma_enabled = FALSE;

      /* Set data transfer defaults for the interface, 512 byte
         blocksize, data timeout of maximum clocks, no default
         callbacks */
      sdparams_dat.data_callback = NULL;
      sdparams_dat.cmd_callback = NULL;
      sdparams_dat.blocksize = 512;
      sdparams_dat.data_to = 0xFFFFFFFF;
      sdparams_dat.use_dma = FALSE;
      sd_set_data_params(&sdparams_dat);

      /* Clean up some data values */
      sdcarddat.dctrl.tosend = 0;
      sdcarddat.dctrl.resp.cmd_status = 0;
      sdcarddat.dctrl.resp.data_status = 0;

      tptr = (INT_32) & sdcarddat;
    }
  }

  return tptr;
}

/***********************************************************************
 *
 * Function: sdcard_close
 *
 * Purpose: Close the SD card controller driver
 *
 * Processing:
 *     If the passed device ID is valid and the device has been
 *     previously initialized, then safely shut down the device and the
 *     associated clocks. Disable interrupts and DMA for teh device.
 *
 * Parameters:
 *     devid: Pointer to SD card controller structure (from sdcard_open)
 *
 * Outputs: None
 *
 * Returns: The status of the close operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS sdcard_close(INT_32 devid)
{
  STATUS status = _ERROR;

  if ((SDCARD_CFG_T *) devid == &sdcarddat)
  {
    if (sdcarddat.init == TRUE)
    {
      /* Disable SD controller interrupts */
      int_disable(IRQ_SD0);
      int_install_irq_handler(IRQ_SD0, (PFV) NULL);
      int_disable(IRQ_SD1);
      int_install_irq_handler(IRQ_SD1, (PFV) NULL);

      /* Disable command and data state machines */
      sdcarddat.regptr->sd_cmd = 0;
      sdcarddat.regptr->sd_dctrl = 0;

      /* Disable all interrupts and place in power-off state */
      sdcarddat.regptr->sd_mask0 = 0;
      sdcarddat.regptr->sd_mask1 = 0;
      sdcarddat.regptr->sd_power =
        (SD_POWER_OFF_MODE | SD_OPENDRAIN_EN);

      /* Disable DMA for the device if it was enabled */
      if (sdcarddat.dmact.dma_enabled == TRUE)
      {
        sd_dma_disable();
      }

      /* Disable SD controller clock */
      sdcarddat.regptr->sd_clock = 0;

      /* Disable SD clock */
      clkpwr_clk_en_dis(CLKPWR_MSCARD_CLK, 0);

      /* Set device as uninitialized */
      sdcarddat.init = FALSE;

      /* Successful operation */
      status = _NO_ERROR;
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: sdcard_ioctl
 *
 * Purpose: SD card controller driver configuration block
 *
 * Processing:
 *     This function is a large case block. Based on the passed function
 *     and option values, perform the associated SD card driver
 *     function.
 *
 * Parameters:
 *     devid: Pointer to KeySD controller driver structure
 *     cmd:   ioctl command
 *     arg:   ioctl argument
 *
 * Outputs: None
 *
 * Returns: The status of the ioctl operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS sdcard_ioctl(INT_32 devid,
                    INT_32 cmd,
                    INT_32 arg)
{
  SD_CMDRESP_T *pCmdResp;
  UNS_32 tmp1, tmp2;
  INT_32 status = _ERROR;

  if ((SDCARD_CFG_T *) devid == &sdcarddat)
  {
    if (sdcarddat.init == TRUE)
    {
      status = _NO_ERROR;

