sobczyk/bsp/csps/lpc32xx/source/lpc32xx_sdcard_driver.c
      switch (cmd)
      {
        case SD_SETUP_PARAMS:
          status = sd_set_ctrl_params(
                     (SDC_PRMS_T *) arg);
          break;

        case SD_SETUP_DATA_XFER:
          status = sd_set_data_params(
                     (SDC_XFER_SETUP_T *) arg);
          break;

        case SD_ISSUE_CMD:
          status = sd_issue_cmd((SD_CMDDATA_T *) arg);
          break;

        case SD_GET_CMD_RESP:
          /* Get last saved response and status */
          pCmdResp = (SD_CMDRESP_T *) arg;
          *pCmdResp = sdcarddat.dctrl.resp;
          break;

        case SD_GET_STATUS:
          /* Return a SDCARD status */
          switch (arg)
          {
            case SD_RAW_STATUS:
              status = (INT_32)
                       sdcarddat.regptr->sd_status;
              break;

            case SD_GET_DMA_CHANNEL:
              status = _ERROR;
              if (sdcarddat.dmact.dma_enabled == TRUE)
              {
                status = sdcarddat.dmact.dmach;
              }
              break;

            case SD_GET_CLOCK:
              tmp1 = clkpwr_get_clock_rate(
                       CLKPWR_MSCARD_CLK);
              tmp2 = sdcarddat.regptr->sd_clock &
                     SD_CLKDIV_MASK;
              status = (STATUS)(tmp1 / (2 * (tmp2 + 1)));
              break;

            default:
              /* Unsupported parameter */
              status = LPC_BAD_PARAMS;
              break;
          }
          break;

        default:
          /* Unsupported parameter */
          status = LPC_BAD_PARAMS;
      }
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: sdcard_read
 *
 * Purpose: SD card controller driver read function (stub only)
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     devid:     Pointer to SD controller driver descriptor
 *     buffer:    Pointer to data buffer to copy to
 *     max_bytes: Number of bytes to read
 *
 * Outputs: None
 *
 * Returns: Number of bytes read, or _NO_ERROR on an error
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 sdcard_read(INT_32 devid,
                   void *buffer,
                   INT_32 max_bytes)
{
  return 0;
}

/***********************************************************************
 *
 * Function: sdcard_write
 *
 * Purpose: SD card controller driver write function (stub only)
 *
 * Processing:
 *     Return 0 to the caller.
 *
 * Parameters:
 *     devid:   Pointer to SD controller driver descriptor
 *     buffer:  Pointer to data buffer to copy from
 *     n_bytes: Number of bytes to write
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually written (always 0)
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 sdcard_write(INT_32 devid,
                    void *buffer,
                    INT_32 n_bytes)
{
  return 0;
}
